Catalogs/КлючиАналитикиУчетаЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>КлючиАналитикиУчетаЗатрат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Comment>Счет учета затрат</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Comment>Субконто 1 счета учета затрат (бухгалтерский учет)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Comment>Субконто 2 счета учета затрат (бухгалтерский учет)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Comment>Субконто 3 счета учета затрат (бухгалтерский учет)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлючиАналитикиУчетаЗатрат/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 УстановитьЗаголовкиСубконто(ЭтаФорма, Объект.СчетЗатрат);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура  УстановитьЗаголовкиСубконто(Форма, СчетЗатрат)

	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3",
								 "Субконто1", "Субконто2", "Субконто3");
	ПоляОбъекта.Вставить("Подразделение", "Подразделение");

	ЗаголовкиПолей = Новый Структура;
	ЗаголовкиПолей.Вставить("Субконто1", "ЗаголовокСубконто1");
	ЗаголовкиПолей.Вставить("Субконто2", "ЗаголовокСубконто2");
	ЗаголовкиПолей.Вставить("Субконто3", "ЗаголовокСубконто3");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(СчетЗатрат, Форма, ПоляОбъекта, ЗаголовкиПолей, Ложь);

КонецПроцедуры
